Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Так как текущая дата - это дата вычисления выражения, которое считается каждый раз при получении значения этого выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то можно, при наличии параметра выражения "Кэшировать рассчитанные значения выражения" включить эту опцию.
en: As the current date is the time of the expression calculation that is calculated each time when getting the expression value. For example, when viewing result in the tabular form or executing data export, it is generally recommended to activate this option if there is "Cache the calculated expression values" expression parameter.

source: Так как текущая дата и время - это время вычисления выражения, которое считается каждый раз при получении значения этого выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то можно, при наличии параметра выражения "Кэшировать рассчитанные значения выражения" включить эту опцию.
en: As the current date and time are the time of the expression calculation that is calculated each time when getting the expression value. For example, when viewing result in the tabular form or executing data export, it is generally recommended to activate this option if there is "Cache the calculated expression values" expression parameter.

source: Так работает линейный нормализатор.
en: This is how the linear normalizer is used.

source: Так, с помощью линейной регрессии можно оценивать объем ожидаемых продаж в зависимости от установленной цены.
en: For example, linear regression enables to estimate anticipated sales volume depending on the established price.

source: Такая возможность позволяет сократить время выполнения Сценария за счет более полного использования вычислительных мощностей компьютера.
en: Such option enables to decrease the Workflow execution time due to fuller use of the computing capacity of the computer.

source: Такая выборка создается для сокращения анализируемого объема данных, например, во избежание избыточных вычислений, т.
en: Such sample is created to decrease the analyzed data volume, for example, to avoid redundant computation,

source: Такая конструкция подстановки дает возможность динамически в ходе выполнения сценария формировать текст запроса.
en: Such substitution construction enables to formulate the request text in a dynamic manner in the course of the workflow execution.

source: Такая ситуация может возникнуть при изменении структуры входных данных.
en: Such situation can take place when the input data structure is changed.

source: Такая стратегия существенно сокращает требования к вычислительным ресурсам, в частности, к оперативной памяти компьютера.
en: Such strategy considerably lowers the requirements to the computational performance, more specifically, to the computer memory (RAM).

source: Также в выражении недопустимо применять рекурсивные обращения к фактам.
en: It is also not allowed to use the recursive calls to measures in the expression.

source: Также в среди полей файлового менеджера присутствуют чекбокс и Удалить все:
en: Checkbox and Delete all are also available in the file manager fields:

source: Также возможно задать верхнюю и нижнюю границу ограничения формы активационной функции.
en: It is also possible to set the upper and lower bounds of the activation function form limit.

source: Также для каждого подключения доступно контекстное меню:
en: The context menu is available for each connection:

source: Также имя узла может использоваться в качестве параметра при пакетном выполнении сценария (см.
en: The node name can be also used as a parameter while Workflow batch processing (refer to

source: Также каждый дочерний узел можно связывать с источником данных командой контекстного меню Связать автоматическиСвязать автоматически.
en: Each child node can be also linked to the data source using the following context menu command: Auto linkAuto link.

source: Также может возникнуть потребность в переобучении, например, в случаях, если Модель перестала быть адекватной задаче или новые исходные данные стали выходить за пределы выборки, на которой ранее производилось обучение.
en: Retraining can be also required, for example, in the cases when the Model is not a relevant task anymore, or the new source data starts to fall outside the limits of the sample used for training earlier.

source: Также можно попробовать авторизоваться автоматически, для этого на стартовой странице Loginom ввести имя пользователя и пароль учетной записи, которая имеется на LDAP сервере и если авторизация прошла успешно, то подключение из Loginom к LDAP серверу настроено правильно.
en: The automatic authorization is also possible. For this purpose, it is required to enter the username and password of the account available on the LDAP server on the Loginom home page. If the authorization is successful, connection to the LDAP server from Loginom has been correctly set.

source: Также можно установить минимальное число значений поля, из которых будут созданы колонки.
en: It is also possible to set the minimum number of the fields values from which the columns will be created.

source: Также некоторые типы данных могут быть совместимы между собой, к примеру, целый и вещественный (см.
en: Besides, some data types can be compatible with each other, for example, integer and real (refer to

source: Также нельзя соединять выходной порт узла с его же входным портом.
en: It is also prohibited to connect the output port of the node with its own input port.

source: Также одним из типов самоорганизующихся сетей является нейронный газ.
en: Neural gas is one ot the types of self-organizing networks.

source: Также переместить поле можно, выбрав нужное поле вызвать выпадающее меню и нажать пункт Переместить вверх или Переместить вниз, в зависимости от нужного действия.
en: It is also possible to move the field by selecting the required field and calling the drop-down menu. Then press Move up or Move down depending on the required action.

source: Также под кнопкой :
en: The following buttons enable to perform the following operations :

source: Также с их помощью проводятся разведочный и описательный анализы.
en: They also enable to perform exploratory and descriptive analysis.

source: Также создать узел-ссылку можно, перетащив мышью выбранное подключение в область построения сценария.
en: It is also possible to create the reference node dragging the required connection to the area of the workflow creation.

source: Также это можно сделать командой контекстного меню Редактировать... Редактировать..., либо, выделив необходимый узел, нажать на кнопку Редактировать....
en: It also can be done using the following contex menu command: Edit... Edit..., or you can select the required node and press Edit... button.

source: Также это можно сделать при помощи кнопок перемещения.
en: It can be also done using the navigation buttons.

source: Также, LGD-файл доступен в редакции Community.
en: The LGD file is also available in the Community edition.

source: Также, нажав на клавишу Список подобъектов можно перейти к подобъектам составного объекта (см.
en: Pressing List of subobjects button, it is possible to go to the subobjects of the complex object (refer to

source: Также, узел можно обучать/переобучать.
en: It is also possible to train/retrain the node.

source: Такие выражения могут быть заданы в таблицах замен.
en: Such expressions will be set in the replacement tables.

source: Такие выражения могут быть заданы во внутренних таблицах замен.
en: Such expressions can be set in the internal replacement tables.

source: Такие отчеты можно обновить нажав кнопку Перечитать данные.
en: Such reports can be updated by pressing Reread data button.

source: Такие связи можно удалить кнопкой Удалить связь.
en: These links can be deleted using Delete link button.

source: Такие узлы требуют первоначального обучения.
en: Initial training is required for such nodes.

source: Таким же образом можно переобучить все вложенные узлы Подмодели или Цикл.
en: Thus, it is possible to retrain all nested nodes of the Supernode or Loop.

source: Таким значением может быть переменная.
en: A variable can represent such value.

source: Таким образом измененное состояние объектов модуля может передаваться от вызова к вызову.
en: Thus, the changed state of the module objects can be transferred from call to call.

source: Таким образом имеется возможность создавать иерархическую структуру сценария.
en: Thus, it is possible to create the hierarchic structure of the workflow.

source: Таким образом набор средств для реализации различной логики обработки данных не ограничивается стандартными компонентами платформы и может быть расширен самим пользователем.
en: Thus, a set of tools for implementation of different data processing logics is not limited by standard platform components, and it can be expanded by users.

source: Таким образом, компонент является прообразом или шаблоном будущего узла сценария.
en: Thus, the component is a prototype or template of the future workflow node.

source: Таким образом, в первом случае повышается значимость признака, а во втором — интепретируемость конечных классов.
en: Thus, in the first case, the indicator significance is increased, whereas in the second case, interpretability of the coarse classes is increased.

source: Таким образом, в первом случае повышается значимость признака, а во втором — интерпретируемость конечных классов.
en: Thus, in the first case, the indicator significance is increased, whereas in the second case, interpretability of the coarse classes is increased.

source: Таким образом, для узла схема движения данных которого представлена на рисунке 2, данные проходят следующие этапы преобразований:
en: Thus, for the node the data movement schema of which is represented on Figure 2, the data undergo the following transformation stages:

source: Таким образом, каждому из выходных полей/переменных можно сопоставить поле/переменную входного набора порта.
en: Thus, each of the output fields/variables can be mapped with field/variable of the input data set of the port.

source: Таким образом, кэширование целесообразно при неоднократном использовании вычисляемых значений последующими обработчиками и визуализаторами во избежание выполнения повторных вычислений.
en: Thus, caching is reasonable in the case of multiple use of the calculated values by the subsequent handlers and visualizers in order to avoid repeated calculations.

source: Таким образом, любое наблюдение (объект) принадлежит ко всем кластерам, но с разной вероятностью.
en: Thus, any observation (object) belongs to all clusters but with different likelihood.

source: Таким образом, на каждом шаге происходит уточнение функций проекта.
en: Thus, the project functions are specified at each stage.

source: Таким образом, набор средств для реализации различной логики обработки данных не ограничивается стандартными компонентами платформы и может быть расширен самим пользователем.
en: Thus, a set of tools for implementation of different data processing logics is not limited by standard platform components, and it can be expanded by users.

source: Таким образом, настройки узлов могут быть предметом вычисления в ходе выполнения Сценария.
en: Thus, the node settings can be the calculation subject matter in the course of the Workflow execution.

source: Таким образом, настройки узлов могут быть предметом вычисления в ходе выполнения сценария.
en: Thus, the node settings can be the calculation subject matter in the course of the workflow execution.

source: Таким образом, они хорошо подходят для кластерного анализа.
en: Thus, they are well suitable for cluster analysis.

source: Таким образом, от узла к узлу может передаваться список переменных.
en: Thus, a list of variables can be transferred from node to node.

source: Таким образом, перед тем как использовать какой-либо файл в сценарии, его необходимо предварительно поместить в файловое хранилище на сервере.
en: Thus, before any file is used in the workflow, it is preliminarily placed into the file storage on the server.

source: Таким образом, переменные пользователя имеют наивысший приоритет.
en: Thus, user variables have the highest priority.

source: Таким образом, перечень классов задается обучающим набором данных в процессе обучения нейросети и не может быть изменен/пересмотрен в процессе классификации.
en: Thus, the list of classes is set by the training data set in the process of the neural network training, and it cannot be changed/reconsidered in the classification process.

source: Таким образом, платформа может использоваться как для создания автономных аналитических решений, так и для разработки модулей, интегрируемых со сторонними системами.
en: Thus, the platform can be used both for creation of indepenent analytical solutions, and for development of modules integrated with external systems.

source: Таким образом, поле значений оси X и поле меток (обозначений делений оси) необязательно должны совпадать.
en: Thus, the X axis values field and caption field (the axis points marks) must not necessarily coincide.

source: Таким образом, собственный режим выполнения узла может быть унаследован от Подмодели самого верхнего уровня.
en: Thus, the own node execution mode can be inherited from the Supernode of the highest level.

source: Таким образом, структура таблицы предполагает наличие одного поля идентификатора транзакций и одного или более полей элементов транзакций.
en: Thus, the table structure presupposes availability of one transaction identifier field and one or more transaction items fields.

source: Таким образом, условие фильтра может задаваться динамически в ходе выполнения сценария.
en: Thus, the filtering criterion can be dynamically set during the workflow execution.

source: Таким образом, этот слой дает пользователю возможность сосредоточиться на анализе и не задумываться о механизмах получения данных.
en: Thus, this layer enables a user to concentrate on analysis and not to think about the data acquisition mechanisms.

source: Такое поле должно быть только одно.
en: Only one such field is allowed.

source: Такой порт может принять в качестве входных данных или отдать в качестве выходных несколько переменных.
en: Such port can accept several variables as input data or deliver them as output data.

source: Такую же структуру будет иметь таблица внешних диапазонов.
en: The external ranges table will have the same structure.

source: Там же содержится информация об установленных в системе драйверах и можно узнать формат строки подключения;
en: It also contains information on the drivers installed in the system, and it is possible to define the connection string format.

source: Тамбовская обл.
en: The Tambov Region

source: Текст, следующий за этим символом и предшествующий следующему его вхождению, импортируется как одно значение, даже если текст содержит символ-разделитель.
en: The text following this character and preceding its subsequent occurrence is imported as one value even if the text contains a separating character.

source: Текстовый файл с разделителями представляет собой обычный текстовый файл, столбцы данных в котором разделены однотипными символами-разделителями, например, символами табуляции, запятыми, точками с запятой и т.
en: The text file with separators is a standard text file the data columns of which are separated with separating characters of the same type, for example, tab characters, commas, semicolumns,

source: Текущие поля модели
en: Current model fields

source: Текущий каталог проекта
en: Current Project Directory

source: Темная.
en: Dark.

source: Темно-зеленая.
en: Dark green.

source: Темно-синяя.
en: Dark blue.

source: Теперь в выходном порте узла присутствуют импортированные данные, которые можно увидеть, выбрав Быстрый просмотр… в контекстном меню порта (см.
en: Now the imported data is present in the output node port. It is possible to view them selecting Quick View… in the context port menu (refer to

source: Тепловая карта;
en: Heatmap;

source: Термин скользящее окно отражает сущность обработки — выделяется некоторый непрерывный отрезок данных, называемый окном, а окно, в свою очередь, перемещается, "скользит" по всему исходному набору данных.
en: The "lag" term reflects the processing nature. A continuous data section is selected. It is called a lag that is "sliding", in its turn, along the whole source data set.

source: Термос стальной
en: Steel vacuum flask

source: Технически обучение заключается в нахождении весов — коэффициентов связей между нейронами.
en: Technically, the training consists in determination of weights — coefficients of links between neurons.

source: Технически обучение заключается в нахождении весов - коэффициентов связей между нейронами.
en: Technically, the training consists in determination of weights — coefficients of links between neurons.

source: Тип
en: Type

source: Тип Content-type запроса — задается значение заголовка Content-type HTTP-запроса к REST-сервису.
en: Type of the Content-type request: the Content-type header value of HTTP request to REST service is set.

source: Тип Content-type ответа — то же, что и для GET метода (см.
en: Type of the Content-type response: the same as for GET method (refer to the information

source: Тип Content-type ответа — узел REST-запрос, использующий данное подключение, проверяет тип ответа на соответствие заявленному в данном параметре.
en: Type of the Content-type response: the REST request node that uses this connection checks the response type for consistency with the data specified in this parameter.

source: Тип данных
en: Data type

source: Тип данных границ диапазонов
en: Range bounds data type

source: Тип данных поля.
en: Type of the field data.

source: Тип данных представлен числом
en: Data type is represented by a number

source: Тип данных;
en: Data type

source: Тип ограничения определяет форму активационной функции выходного слоя Нейросети:
en: The limit type defines the form of activation function of the output Neural Network layer:

source: Тип операции (способ слияния) можно выбрать из выпадающего списка или задать с помощью управляющей переменной целого типа (см.
en: Operation type (join method) can be selected from the drop-down list, or it can be set using the control variable of the integer type (refer to

source: Тип оси.
en: Axis type.

source: Тип самоорганизующейся сети:
en: Type of self-organizing network:

source: Тип события.
en: Event type.

source: Тип сортировки можно выбрать двумя способами: через заголовочное меню выбранной колонки по клику на кнопку Раскрыть и непосредственным кликом на колонку.
en: It is possible to select the sorting type in two ways: via the caption menu of the selected column by clicking on Open button and clicking on the column.

source: Тип — задается тип диаграммы (типы приведены далее в статье).
en: Type: the chart type is set (the types are listed in the article below).

source: Типом;
en: Type

source: Типы в данном столбце обозначаются цифрами.
en: The types in this column are numerated as follows:

source: Типы данных поля таблицы и связываемого объекта должны совпадать.
en: Types of the table field data and linked object must coincide.

source: Типы данных поля таблицы и связываемого элемента должны совпадать.
en: Types of the table field data and linked item must coincide.

source: Типы палитры.
en: Palette types.

source: Типы подключений
en: Types of Connections

source: То есть количество конечных классов будет соответствовать количеству уникальных значений на входе, максимально возможное число — 1000.
en: Namely, the coarse classes count will meet the unique values count at the input, maximum possible count - 1000.

source: То есть получились два полуинтервала вида [5, 10) и [10, 15).
en: So, there are two half-intervals: [5, 10) and [10, 15).

source: То есть текущим каталогом для производного узла будет текущий каталог пакета, в котором находится именно производный узел, а не базовый.
en: Thus, the current directory of the derived node will be the current package directory in which exactly the derived node is located but not the base one.

source: То же самое можно сделать при помощи Drag-and-Drop.
en: The Drag-and-Drop method enables to perform the same actions.

source: То же самое можно сделать при помощи Drag-and-drop.
en: The Drag-and-Drop method enables to perform the same actions.

source: То же самое можно сделать, написав имя измерения или факта в область ввода вручную.
en: The same actions can be done by manual writing the dimension or measure name in the entry area.

source: То же самое можно сделать, перетащив функцию из списка в область кода (Drag-and-Drop).
en: The same operations can be done by dragging function from the list to the code area (Drag-and-Drop).

source: То, в каком порядке расположены поля, влияет на структуру результирующей таблицы.
en: The order of fields location has an impact on the resulting table structure.

source: Товар
en: Goods

source: Товары для дачи
en: Goods for summer cottage

source: Товары для дома
en: Household goods

source: Тогда конечный пользователь открывает панель отчетов, выбирает нужную группу и в этой группе активизирует нужный отчет.
en: Then the end user opens the reports panel, selects the required group and activates the required report in this group.

source: Только сверху — усеченная сверху экспонента.
en: Top only — exponent truncated from above.

source: Только снизу — усеченная снизу экспонента.
en: Bottom only — exponent truncated from below.

source: Томатная паста
en: Tomato paste

source: Топология сети: 1D, 2D прямоугольная, 2D гексагональная, 3D.
en: Network topology: 1D, 2D rectangular, 2D hexagonal, 3D.

source: Точка (.);
en: Dot (.)

source: Точка продажи
en: Point of sale

source: Точка с запятой;
en: Semicolumn

source: Точка.
en: Dot

source: Точные данные.
en: Accurate data.

source: Транзакцией в данном примере является чек продажи, содержащий список приобретенных товаров, а каждый товар в чеке является элементом транзакции.
en: The transaction specified in this example is a sales check that contains a list of acquired goods, and each item of goods in the check is a transaction item.

source: Транзакции фиксируются через указанное количество строк.
en: Transactions are committed after a given count of rows.

source: Требования к внешнему разбиению
en: Requirements to the External Binning

source: Требования к принимаемым данным
en: Requirements to the Received Data

source: Требуется для взаимодействия с нестандартными веб-сервисами, например, с бюро кредитных историй.
en: It is required for interaction with non-standard web services, for example, with credit reference bureau.

source: Требуется минимум преобразований при получении или записи данных и скорость обмена информацией в этом случае ограничивается только скоростью работы дисковой подсистемы и гораздо меньше зависит от объема данных, чем при работе с прочими форматами.
en: Minimum number of transformations is required to get or record data. In this case, data exchange speed is limited only by the speed of the disk subsystem operation and it depends on the data volume much less as compared with other formats that can be used.

source: Тут перечислены термины и сокращения используемые в описании визуализатора Качество бинарной классификации.
en: Terms and abbreviations used in the description of Binary сlassification assessment visualizer are listed here.

source: У переменной может быть только одно значение, поэтому для его расчета к данным поля применяются различные функции агрегации.
en: A variable can have only one value that's why different aggregation functions are applied to the field data for its calculation.
